In [1]:

#expanding initial exploration of the "tags" table

import duckdb, pandas as pd
from pathlib import Path

#create or connect if it already exists
con = duckdb.connect("movielens100K.duckdb")

In [2]:
#Ver estrutura da tabela (colunas e tipos de dados)
con.sql("DESCRIBE tags").df()

  column_name               column_type null   key default extra
0      userId                   INTEGER  YES  None    None  None
1     movieId                   INTEGER  YES  None    None  None
2         tag                   VARCHAR  YES  None    None  None
3   timestamp  TIMESTAMP WITH TIME ZONE  YES  None    None  None

### Comment

 - "userID": BIGINT 64 bits value;
 - "movieID":  BIGINT 64 bits value;
 - "tag": VARCHAR;
 - "timestamp":  BIGINT 64 bits value;

In [3]:
#check the data types of each column
con.sql("PRAGMA table_info('tags')").df()

   cid       name                      type  notnull dflt_value     pk
0    0     userId                   INTEGER    False       None  False
1    1    movieId                   INTEGER    False       None  False
2    2        tag                   VARCHAR    False       None  False
3    3  timestamp  TIMESTAMP WITH TIME ZONE    False       None  False

### Comments

- The column `notnull` (boolean) shows four zero values.  
  - Therefore, this table allows null (NULL) values.  
  - Since the DataFrame was loaded using `read_csv_auto`, DuckDB does not enforce NOT NULL constraints.

- The column `dflt_value` shows the default value assigned when no other value is specified during an INSERT operation.  
  - In datasets imported with `read_csv_auto` (such as MovieLens), this column almost always appears as NULL.

- The column `pk` (boolean) indicates whether the column is part of the table’s primary key.  
  - It is not.

In [4]:
#check first 10 rows
con.sql("SELECT * FROM tags LIMIT 10").df()

   userId  movieId            tag                 timestamp
0      10      260   good vs evil 2015-05-03 16:22:38+01:00
1      10      260  Harrison Ford 2015-05-03 16:21:45+01:00
2      10      260         sci-fi 2015-05-03 16:22:18+01:00
3      14     1221      Al Pacino 2011-07-25 14:32:36+01:00
4      14     1221          mafia 2011-07-25 14:32:26+01:00
5      14    58559    Atmospheric 2011-07-24 19:00:39+01:00
6      14    58559         Batman 2011-07-24 18:59:51+01:00
7      14    58559     comic book 2011-07-24 18:59:58+01:00
8      14    58559           dark 2011-07-24 19:00:28+01:00
9      14    58559   Heath Ledger 2011-07-24 19:00:04+01:00

In [5]:
# count total number of rows
con.sql("SELECT COUNT(*) AS total_registos FROM tags").df()

   total_registos
0         2328315

In [6]:
#count the number of missing values
con.sql("""
SELECT
    COUNT(*) - COUNT(userId) AS missing_userId,
    COUNT(*) - COUNT(movieId) AS missing_movieId,
    COUNT(*) - COUNT(tag) AS missing_tag,
    COUNT(*) - COUNT(timestamp) AS missing_timestamp
FROM tags
""").df()

   missing_userId  missing_movieId  missing_tag  missing_timestamp
0               0                0            0                  0

#### Fechar a ligação

In [7]:
con.close()
print("Ligação fechada.")

Ligação fechada.